Revit 2026 API

# BackClippingParam Enumeration

---

The allowed values for the VIEW_BACK_CLIPPING and VIEWER_BOUND_FAR_CLIPPING parameters.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BackClippingParam
```
```vb
Public Enumeration BackClippingParam
```
```cpp
public enum class BackClippingParam
```
```fsharp
type BackClippingParam
```

| Member name | Value | Description |
| --- | --- | --- |
| ClipNoLine | 2 | Clip without line. |
| ClipWithLine | 1 | Clip with line. |
| NoClip | 0 | No clip |

#### Reference

Autodesk.Revit.DB Namespace